app/Controllers/DatapenggunaController.php

SELECT `tb_datapengguna`.`id`, `tb_datapengguna`.`username`, `tb_datapengguna`.`nama`, `tb_datapengguna`.`email`, `tb_datapengguna`.`profil`, `tb_hakakses`.`akses`
FROM `tb_datapengguna`
JOIN `tb_hakakses` ON `tb_datapengguna`.`role` = `tb_hakakses`.`id`
---
    public function index()
    {
        if (isset($_SESSION['akses']) && $_SESSION['akses'] == 'admin') {
            $data = [
                'page' => 'Data Pengguna',
                'url' => ['Beranda', 'Admin'],
                'user' => $this->DatapenggunaModel->select(['tb_datapengguna.id', 'tb_datapengguna.username', 'tb_datapengguna.nama', 'tb_datapengguna.email', 'tb_datapengguna.profil', 'tb_hakakses.akses'])->join('tb_hakakses', 'tb_datapengguna.role = tb_hakakses.id')->findAll(),