app/Controllers/HalamanAdminController.php

SELECT SUM(`jumlah`) AS `jumlah`
FROM `tb_pemasukan`
WHERE `tanggal` < "2022-11-17"
SELECT SUM(`jumlah`) AS `jumlah`
FROM `tb_pengeluaran`
WHERE `tanggal` < "2022-11-17"
SELECT `id`, `tanggal`, `ket`, `jumlah`
FROM `tb_pemasukan`
WHERE `tanggal` BETWEEN "2022-11-17" and "2022-12-17"
SELECT SUM(`jumlah`) AS `jumlah`
FROM `tb_pemasukan`
WHERE `tanggal` BETWEEN "2022-11-17" and "2022-12-17"
SELECT `id`, `tanggal`, `ket`, `jumlah`
FROM `tb_pengeluaran`
WHERE `tanggal` BETWEEN "2022-11-17" and "2022-12-17"
SELECT SUM(`jumlah`) AS `jumlah`
FROM `tb_pengeluaran`
WHERE `tanggal` BETWEEN "2022-11-17" and "2022-12-17"
---
    public function rekap()
    {
        if (isset($_SESSION['username'])) {
            $dari = (isset($_GET['dari']) && $this->pengeluaran->checkDateFormat($_GET['dari'])) ? $_GET['dari'] : date('Y-m-d', strtotime("-30 day", strtotime(date("Y-m-d"))));
            $sampai = (isset($_GET['sampai']) && $this->pengeluaran->checkDateFormat($_GET['dari'])) ? $_GET['sampai'] : date('Y-m-d');
            if ($dari >= $sampai) {
                $temp = $dari;
                $dari = $sampai;
                $sampai = $temp;
            }
            $masuk_sblm = $this->pemasukan->selectSum('jumlah')->where('tanggal < "' . $dari . '"')->find()[0]->jumlah;
            $keluar_sblm = $this->pengeluaran->selectSum('jumlah')->where('tanggal < "' . $dari . '"')->find()[0]->jumlah;
            $sblm = $masuk_sblm - $keluar_sblm;
            $data = [
                'page' => 'Rekap Kas',
                'url' => ['Beranda', 'Kas'],
                'sebagai' => $this->sebagai,
                'periode' => ['awal' => $dari, 'akhir' => $sampai],
                'jum_sblm' => $sblm,
                'kas_masuk' => $this->pemasukan->select(['id', 'tanggal', 'ket', 'jumlah'])->where('tanggal BETWEEN "' . date('Y-m-d', strtotime($dari)) . '" and "' . date('Y-m-d', strtotime($sampai)) . '"')->find(),
                'jum_masuk' => $this->pemasukan->selectSum('jumlah')->where('tanggal BETWEEN "' . date('Y-m-d', strtotime($dari)) . '" and "' . date('Y-m-d', strtotime($sampai)) . '"')->find()[0]->jumlah,
                'kas_keluar' => $this->pengeluaran->select(['id', 'tanggal', 'ket', 'jumlah'])->where('tanggal BETWEEN "' . date('Y-m-d', strtotime($dari)) . '" and "' . date('Y-m-d', strtotime($sampai)) . '"')->find(),
                'jum_keluar' => $this->pengeluaran->selectSum('jumlah')->where('tanggal BETWEEN "' . date('Y-m-d', strtotime($dari)) . '" and "' . date('Y-m-d', strtotime($sampai)) . '"')->find()[0]->jumlah,