app/Controllers/HomeController.php

    public function home()
    {
        $setting = $this->SettingModel->ViewSetting();
        $url = 'https://api.myquran.com/v1/sholat/jadwal/' . $setting['id_kota'] . '/' . date('Y') . '/' . date('m') . '/' . date('d');
        $waktu = json_decode(file_get_contents($url), true);

        $masuk_sblm = $this->pemasukan->selectSum('jumlah')->find()[0]->jumlah;
        $keluar_sblm = $this->pengeluaran->selectSum('jumlah')->find()[0]->jumlah;
        $akhir = $masuk_sblm - $keluar_sblm;
        $data = [
            'pagekegiatan' => 'Kegiatan',
            'pageartikel' => 'Artikel',
            'pagekas' => 'Rekap Kas',
            'kegiatan' => $this->kegiatan->select(['tanggal', 'keterangan', 'pj'])->find(),
            'artikel' => $this->artikel
                ->select(['tb_datapengguna.nama', 'tb_artikel.id', 'tb_artikel.gambar', 'tb_artikel.judul', 'tb_artikel.updated_at', 'tb_artikel.konten'])
                ->join('tb_datapengguna', 'tb_artikel.penulis  = tb_datapengguna.id')
                ->find(),
---
SELECT SUM(`jumlah`) AS `jumlah`
FROM `tb_pemasukan`
SELECT SUM(`jumlah`) AS `jumlah`
FROM `tb_pengeluaran`
SELECT `tanggal`, `keterangan`, `pj`
FROM `tb_kegiatan`
SELECT `tb_datapengguna`.`nama`, `tb_artikel`.`id`, `tb_artikel`.`gambar`, `tb_artikel`.`judul`, `tb_artikel`.`updated_at`, `tb_artikel`.`konten`
FROM `tb_artikel`
JOIN `tb_datapengguna` ON `tb_artikel`.`penulis`  = `tb_datapengguna`.`id`

    public function blog()
    {
        $data = [
            'artikel' => $this->artikel
                ->select(['tb_datapengguna.nama', 'tb_artikel.id', 'tb_artikel.gambar', 'tb_artikel.judul', 'tb_artikel.updated_at', 'tb_artikel.konten'])
                ->join('tb_datapengguna', 'tb_artikel.penulis  = tb_datapengguna.id')
                ->find(),
            'setting' => $this->SettingModel->ViewSetting(),
        ];
---
SELECT `tb_datapengguna`.`nama`, `tb_artikel`.`id`, `tb_artikel`.`gambar`, `tb_artikel`.`judul`, `tb_artikel`.`updated_at`, `tb_artikel`.`konten`
FROM `tb_artikel`
JOIN `tb_datapengguna` ON `tb_artikel`.`penulis`  = `tb_datapengguna`.`id`