app/Controllers/LoginController.php

SELECT *
FROM `tb_datapengguna`
WHERE `username` = 'admin'
 LIMIT 1
SELECT `tb_datapengguna`.`id`, `tb_datapengguna`.`username`, `tb_datapengguna`.`nama`, `tb_datapengguna`.`email`, `tb_datapengguna`.`profil`, `tb_hakakses`.`akses`
FROM `tb_datapengguna`
JOIN `tb_hakakses` ON `tb_datapengguna`.`role` = `tb_hakakses`.`id`
WHERE `username` = 'admin'
 LIMIT 1
---
    public function login()
    {
        if (!$this->validate([
            'username' => 'required',
            'password' => 'required'
        ])) {
            $this->session->setFlashdata('message', "username dan password harus diisi");
            return redirect()->to(base_url('login'));
        } else {
            $username = strtolower($this->request->getVar('username'));
            $password = $this->request->getVar('password');
            $data = $this->DatapenggunaModel->where('username', $username)->first();
            if (isset($data) && password_verify($password, $data->password)) {
                $masuk = $this->DatapenggunaModel->select(['tb_datapengguna.id', 'tb_datapengguna.username', 'tb_datapengguna.nama', 'tb_datapengguna.email', 'tb_datapengguna.profil', 'tb_hakakses.akses'])->join('tb_hakakses', 'tb_datapengguna.role = tb_hakakses.id')->where('username', $username)->first();