app/Models/SettingModel.php

SELECT *
FROM `tb_setting`
WHERE `id` = 1
---
    public function ViewSetting()
    {
        return $this->db->table('tb_setting')
            ->where('id', 1)
            ->get()->getRowArray();

UPDATE `tb_setting` SET `id` = 1, `nama_masjid` = 'Al-furqon', `id_kota` = '1504', `alamat` = 'Sleman yogyakarta'
WHERE `id` = 1
---
    public function UpdateSetting($data)
    {
        $this->db->table('tb_setting')
            ->where('id', 1)
            ->update($data);